Model: "mobile_face_net"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 112, 112, 3) 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 56, 56, 64)   1728        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 56, 56, 64)   256         conv2d[0][0]
__________________________________________________________________________________________________
p_re_lu (PReLU)                 (None, 56, 56, 64)   64          batch_normalization[0][0]        
__________________________________________________________________________________________________
separable_conv2d (SeparableConv (None, 56, 56, 64)   4672        p_re_lu[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 56, 56, 64)   256         separable_conv2d[0][0]
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 56, 56, 64)   64          batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 56, 56, 128)  8192        p_re_lu_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 56, 56, 128)  512         conv2d_1[0][0]
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 56, 56, 128)  128         batch_normalization_2[0][0]
__________________________________________________________________________________________________
depthwise_conv2d (DepthwiseConv (None, 28, 28, 128)  1152        p_re_lu_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 28, 28, 128)  512         depthwise_conv2d[0][0]
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 64)   8192        p_re_lu_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 28, 28, 64)   256         conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 128)  8192        batch_normalization_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 28, 28, 128)  512         conv2d_3[0][0]
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_5[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_1 (DepthwiseCo (None, 28, 28, 128)  1152        p_re_lu_4[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 28, 28, 128)  512         depthwise_conv2d_1[0][0]
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 28, 28, 64)   8192        p_re_lu_5[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 28, 28, 64)   256         conv2d_4[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 28, 28, 64)   0           batch_normalization_7[0][0]
                                                                 batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 28, 28, 128)  8192        add[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 28, 28, 128)  512         conv2d_5[0][0]
__________________________________________________________________________________________________
p_re_lu_6 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_8[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_2 (DepthwiseCo (None, 28, 28, 128)  1152        p_re_lu_6[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 28, 28, 128)  512         depthwise_conv2d_2[0][0]
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 28, 28, 64)   8192        p_re_lu_7[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 28, 28, 64)   256         conv2d_6[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 28, 28, 64)   0           batch_normalization_10[0][0]
                                                                 add[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 28, 28, 128)  8192        add_1[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 28, 28, 128)  512         conv2d_7[0][0]
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_11[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_3 (DepthwiseCo (None, 28, 28, 128)  1152        p_re_lu_8[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 28, 28, 128)  512         depthwise_conv2d_3[0][0]
__________________________________________________________________________________________________
p_re_lu_9 (PReLU)               (None, 28, 28, 128)  128         batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 28, 28, 64)   8192        p_re_lu_9[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 28, 28, 64)   256         conv2d_8[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 28, 28, 64)   0           batch_normalization_13[0][0]
                                                                 add_1[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 28, 28, 128)  8192        add_2[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 28, 28, 128)  512         conv2d_9[0][0]
__________________________________________________________________________________________________
p_re_lu_10 (PReLU)              (None, 28, 28, 128)  128         batch_normalization_14[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_4 (DepthwiseCo (None, 28, 28, 128)  1152        p_re_lu_10[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 28, 28, 128)  512         depthwise_conv2d_4[0][0]
__________________________________________________________________________________________________
p_re_lu_11 (PReLU)              (None, 28, 28, 128)  128         batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 28, 28, 64)   8192        p_re_lu_11[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 28, 28, 64)   256         conv2d_10[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 28, 28, 64)   0           batch_normalization_16[0][0]
                                                                 add_2[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 28, 28, 256)  16384       add_3[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 28, 28, 256)  1024        conv2d_11[0][0]
__________________________________________________________________________________________________
p_re_lu_12 (PReLU)              (None, 28, 28, 256)  256         batch_normalization_17[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_5 (DepthwiseCo (None, 14, 14, 256)  2304        p_re_lu_12[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_5[0][0]
__________________________________________________________________________________________________
p_re_lu_13 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_18[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_13[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 14, 14, 128)  512         conv2d_12[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 14, 14, 256)  32768       batch_normalization_19[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 14, 14, 256)  1024        conv2d_13[0][0]
__________________________________________________________________________________________________
p_re_lu_14 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_20[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_6 (DepthwiseCo (None, 14, 14, 256)  2304        p_re_lu_14[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_6[0][0]
__________________________________________________________________________________________________
p_re_lu_15 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_21[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_15[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 14, 14, 128)  512         conv2d_14[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 14, 14, 256)  32768       batch_normalization_22[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 14, 14, 256)  1024        conv2d_15[0][0]
__________________________________________________________________________________________________
p_re_lu_16 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_23[0][0]     
__________________________________________________________________________________________________
depthwise_conv2d_7 (DepthwiseCo (None, 14, 14, 256)  2304        p_re_lu_16[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_7[0][0]
__________________________________________________________________________________________________
p_re_lu_17 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_24[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_17[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 14, 14, 128)  512         conv2d_16[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 14, 14, 128)  0           batch_normalization_25[0][0]
                                                                 batch_normalization_22[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 14, 14, 256)  32768       add_4[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 14, 14, 256)  1024        conv2d_17[0][0]
__________________________________________________________________________________________________
p_re_lu_18 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_26[0][0]     
__________________________________________________________________________________________________
depthwise_conv2d_8 (DepthwiseCo (None, 14, 14, 256)  2304        p_re_lu_18[0][0]
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_8[0][0]
__________________________________________________________________________________________________
p_re_lu_19 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_27[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_19[0][0]
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 14, 14, 128)  512         conv2d_18[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 14, 14, 128)  0           batch_normalization_28[0][0]
                                                                 add_4[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 14, 14, 256)  32768       add_5[0][0]
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 14, 14, 256)  1024        conv2d_19[0][0]
__________________________________________________________________________________________________
p_re_lu_20 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_29[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_9 (DepthwiseCo (None, 14, 14, 256)  2304        p_re_lu_20[0][0]
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_9[0][0]
__________________________________________________________________________________________________
p_re_lu_21 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_30[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_21[0][0]
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 14, 14, 128)  512         conv2d_20[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 14, 14, 128)  0           batch_normalization_31[0][0]
                                                                 add_5[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 14, 14, 256)  32768       add_6[0][0]
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 14, 14, 256)  1024        conv2d_21[0][0]
__________________________________________________________________________________________________
p_re_lu_22 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_32[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_10 (DepthwiseC (None, 14, 14, 256)  2304        p_re_lu_22[0][0]
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_10[0][0]
__________________________________________________________________________________________________
p_re_lu_23 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_33[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_23[0][0]
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 14, 14, 128)  512         conv2d_22[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 14, 14, 128)  0           batch_normalization_34[0][0]
                                                                 add_6[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 14, 14, 256)  32768       add_7[0][0]
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 14, 14, 256)  1024        conv2d_23[0][0]
__________________________________________________________________________________________________
p_re_lu_24 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_35[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_11 (DepthwiseC (None, 14, 14, 256)  2304        p_re_lu_24[0][0]
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 14, 14, 256)  1024        depthwise_conv2d_11[0][0]
__________________________________________________________________________________________________
p_re_lu_25 (PReLU)              (None, 14, 14, 256)  256         batch_normalization_36[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 14, 14, 128)  32768       p_re_lu_25[0][0]
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 14, 14, 128)  512         conv2d_24[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 14, 14, 128)  0           batch_normalization_37[0][0]
                                                                 add_7[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 14, 14, 512)  65536       add_8[0][0]
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 14, 14, 512)  2048        conv2d_25[0][0]
__________________________________________________________________________________________________
p_re_lu_26 (PReLU)              (None, 14, 14, 512)  512         batch_normalization_38[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_12 (DepthwiseC (None, 7, 7, 512)    4608        p_re_lu_26[0][0]
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 7, 7, 512)    2048        depthwise_conv2d_12[0][0]
__________________________________________________________________________________________________
p_re_lu_27 (PReLU)              (None, 7, 7, 512)    512         batch_normalization_39[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 7, 7, 128)    65536       p_re_lu_27[0][0]
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 7, 7, 128)    512         conv2d_26[0][0]
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 7, 7, 256)    32768       batch_normalization_40[0][0]
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 7, 7, 256)    1024        conv2d_27[0][0]
__________________________________________________________________________________________________
p_re_lu_28 (PReLU)              (None, 7, 7, 256)    256         batch_normalization_41[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_13 (DepthwiseC (None, 7, 7, 256)    2304        p_re_lu_28[0][0]
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 7, 7, 256)    1024        depthwise_conv2d_13[0][0]
__________________________________________________________________________________________________
p_re_lu_29 (PReLU)              (None, 7, 7, 256)    256         batch_normalization_42[0][0]
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 7, 7, 128)    32768       p_re_lu_29[0][0]
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 7, 7, 128)    512         conv2d_28[0][0]
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 7, 7, 256)    32768       batch_normalization_43[0][0]
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 7, 7, 256)    1024        conv2d_29[0][0]
__________________________________________________________________________________________________
p_re_lu_30 (PReLU)              (None, 7, 7, 256)    256         batch_normalization_44[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_14 (DepthwiseC (None, 7, 7, 256)    2304        p_re_lu_30[0][0]
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 7, 7, 256)    1024        depthwise_conv2d_14[0][0]
__________________________________________________________________________________________________
p_re_lu_31 (PReLU)              (None, 7, 7, 256)    256         batch_normalization_45[0][0]
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 7, 7, 128)    32768       p_re_lu_31[0][0]
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 7, 7, 128)    512         conv2d_30[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 7, 7, 128)    0           batch_normalization_46[0][0]
                                                                 batch_normalization_43[0][0]
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 7, 7, 512)    65536       add_9[0][0]
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 7, 7, 512)    2048        conv2d_31[0][0]
__________________________________________________________________________________________________
p_re_lu_32 (PReLU)              (None, 7, 7, 512)    512         batch_normalization_47[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_15 (DepthwiseC (None, 1, 1, 512)    25088       p_re_lu_32[0][0]
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 1, 1, 512)    2048        depthwise_conv2d_15[0][0]
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 1, 1, 128)    65536       batch_normalization_48[0][0]
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 1, 1, 128)    512         conv2d_32[0][0]
__________________________________________________________________________________________________
p_re_lu_33 (PReLU)              (None, 1, 1, 128)    128         batch_normalization_49[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 128)          0           p_re_lu_33[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          16384       flatten[0][0]
==================================================================================================
Total params: 1,043,328
Trainable params: 1,023,744
Non-trainable params: 19,584
__________________________________________________________________________________________________
